/**
 * Copyright (C) 2020 Lachesis <petrifiedrowan@gmail.com>
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 */

#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "Bitstream.hpp"
#include "modutil.hpp"

static int num_its;
//static int num_it_instrument_mode;
//static int num_it_sample_gvol;
//static int num_it_sample_vibrato;


enum IT_features
{
  FT_OLD_FORMAT,
  FT_MIDI_CONFIG,
  FT_SAMPLE_MODE,
  FT_INSTRUMENT_MODE,
  FT_SAMPLE_GLOBAL_VOLUME,
  FT_SAMPLE_VIBRATO,
  FT_SAMPLE_COMPRESSION,
  FT_SAMPLE_COMPRESSION_1_4TH,
  FT_SAMPLE_COMPRESSION_1_8TH,
  FT_SAMPLE_COMPRESSION_INVALID_WIDTH,
  FT_SAMPLE_STEREO,
  FT_SAMPLE_16,
  FT_SAMPLE_ADPCM,
  FT_ENV_VOLUME,
  FT_ENV_PAN,
  FT_ENV_PITCH,
  FT_ENV_FILTER,
  FT_E_MACROSET,
  FT_E_MACRO,
  FT_E_MACROSMOOTH,
  NUM_FEATURES
};

static const char *FEATURE_STR[NUM_FEATURES] =
{
  "<2.00",
  "MidiCfg",
  "SmplMode",
  "InstMode",
  "SmpGVL",
  "SmpVib",
  "SmpCmp",
  "SmpCmp<1/4th",
  "SmpCmp<1/8th",
  "SmpCmpInvalidBW",
  "S:Stereo",
  "S:16",
  "S:ADPCM",
  "EnvVol",
  "EnvPan",
  "EnvPitch",
  "EnvFilter",
  "E:MacroSet",
  "E:Macro",
  "E:MacroSmooth",
};

enum IT_flags
{
  F_STEREO           = (1 << 0),
  F_VOL_0_OPT        = (1 << 1),
  F_INST_MODE        = (1 << 2),
  F_LINEAR_PORTA     = (1 << 3),
  F_OLD_EFFECTS      = (1 << 4),
  F_SHARED_PORTA_MEM = (1 << 5),
  F_MIDI_PITCH       = (1 << 6),
  F_MIDI_CONFIG      = (1 << 7)
};

enum IT_special
{
  FS_SONG_MESSAGE    = (1 << 0),
  FS_MIDI_CONFIG     = (1 << 3)
};

enum IT_sample_flags
{
  SAMPLE_SET               = (1 << 0),
  SAMPLE_16_BIT            = (1 << 1),
  SAMPLE_STEREO            = (1 << 2),
  SAMPLE_COMPRESSED        = (1 << 3),
  SAMPLE_LOOP              = (1 << 4),
  SAMPLE_SUSTAIN_LOOP      = (1 << 5),
  SAMPLE_BIDI_LOOP         = (1 << 6),
  SAMPLE_BIDI_SUSTAIN_LOOP = (1 << 7),
};

enum IT_vibrato_waveforms
{
  WF_SINE_WAVE,
  WF_RAMP_DOWN,
  WF_SQUARE_WAVE,
  WF_RANDOM
};

static constexpr int MAX_ENVELOPE = 25;

static const char *NNA_string(unsigned int nna)
{
  static const char NNA_TYPE[4][5]
  {
    "Cut", "Cont", "Off", "Fade"
  };
  return (nna < (size_t)arraysize(NNA_TYPE)) ? NNA_TYPE[nna] : "?";
}

static const char *DCT_string(unsigned int dct)
{
  static const char DCT_TYPE[4][5]
  {
    "Off", "Note", "Smpl", "Inst"
  };
  return (dct < (size_t)arraysize(DCT_TYPE)) ? DCT_TYPE[dct] : "?";
}

static const char *DCA_string(unsigned int dca)
{
  static const char DCA_TYPE[3][5]
  {
    "Cut", "Off", "Fade"
  };
  return (dca < (size_t)arraysize(DCA_TYPE)) ? DCA_TYPE[dca] : "?";
}


struct IT_keymap
{
  uint8_t  note;
  uint8_t  sample;
};

struct IT_node
{
  int8_t   value; /* Note: no padding in file. */
  uint16_t tick;
};

struct IT_envelope
{
  enum IT_envelope_flags
  {
    ENABLED = (1<<0),
    LOOP    = (1<<1),
    SUSTAIN = (1<<2),
    CARRY   = (1<<3),
    FILTER  = (1<<7), /* Sets pitch envelope to act as a filter envelope instead. */
  };

  /*  00 */ uint8_t  flags;
  /*  01 */ uint8_t  num_nodes;
  /*  02 */ uint8_t  loop_start;
  /*  03 */ uint8_t  loop_end;
  /*  04 */ uint8_t  sustain_start;
  /*  05 */ uint8_t  sustain_end;
  /*  06 */ IT_node  nodes[MAX_ENVELOPE];
};

struct IT_instrument
{
  /*  00 */ char     magic[4]; /* IMPI */
  /*  04 */ char     filename[13];
  /*  17 */ uint8_t  new_note_act;
  /*  18 */ uint8_t  duplicate_check_type;
  /*  19 */ uint8_t  duplicate_check_act;
  /*  20 */ uint16_t fadeout;
  /*  22 */ int8_t   pitch_pan_sep;
  /*  23 */ uint8_t  pitch_pan_center;
  /*  24 */ uint8_t  global_volume;
  /*  25 */ uint8_t  default_pan;
  /*  26 */ uint8_t  random_volume;
  /*  27 */ uint8_t  random_pan;
  /*  28 */ uint16_t tracker_version; /* Inst. files only. */
  /*  30 */ uint8_t  num_samples;     /* Inst. files only. */
  /*  31 */ uint8_t  pad;
  /*  32 */ char     name[26];
  /*  58 */ uint8_t  init_filter_cutoff;
  /*  59 */ uint8_t  init_filter_resonance;
  /*  60 */ uint8_t  midi_channel;
  /*  61 */ uint8_t  midi_program;
  /*  62 */ uint16_t midi_bank;
  /*  64 */ IT_keymap keymap[120];
  /* 304 */

  IT_envelope env_volume;
  IT_envelope env_pan;
  IT_envelope env_pitch;

  /* Derived values. */
  int real_default_pan;
  int real_init_filter_cutoff;
  int real_init_filter_resonance;
};

struct IT_sample
{
  /*  00 */ char     magic[4]; /* IMPS */
  /*  04 */ char     filename[13];
  /*  17 */ uint8_t  global_volume;
  /*  18 */ uint8_t  flags;
  /*  19 */ uint8_t  default_volume;
  /*  20 */ char     name[26];
  /*  46 */ uint8_t  convert;
  /*  47 */ uint8_t  default_pan;
  /*  48 */ uint32_t length; /* in samples, not bytes. */
  /*  52 */ uint32_t loop_start; /* in samples, not bytes. */
  /*  56 */ uint32_t loop_end; /* in samples, not bytes */
  /*  60 */ uint32_t c5_speed;
  /*  64 */ uint32_t sustain_loop_start;
  /*  68 */ uint32_t sustain_loop_end;
  /*  72 */ uint32_t sample_data_offset;
  /*  76 */ uint8_t  vibrato_speed;
  /*  77 */ uint8_t  vibrato_depth;
  /*  78 */ uint8_t  vibrato_waveform;
  /*  79 */ uint8_t  vibrato_rate;

  /* Derived values for compressed samples. */
  bool     scanned;
  uint32_t uncompressed_bytes;
  uint32_t compressed_bytes;
  uint32_t smallest_block;
  uint32_t smallest_block_samples;
  uint32_t largest_block;
};

struct IT_event
{
  enum
  {
    NOTE            = (1 << 0),
    INSTRUMENT      = (1 << 1),
    VOLUME          = (1 << 2),
    EFFECT          = (1 << 3),
    LAST_NOTE       = (1 << 4),
    LAST_INSTRUMENT = (1 << 5),
    LAST_VOLUME     = (1 << 6),
    LAST_EFFECT     = (1 << 7),

    CHANNEL         = 0x3f,
    READ_MASK       = (1 << 7),

    NO_VOLUME       = 0,
    SET_VOLUME      = 1,
    SET_PAN         = 2,
    FINE_VOLUME_UP  = 3,
    FINE_VOLUME_DN  = 4,
    VOLUME_UP       = 5,
    VOLUME_DN       = 6,
    PORTA_UP        = 7,
    PORTA_DN        = 8,
    TONEPORTA       = 9,
    VIBRATO         = 10,
    VOLUME_INVALID  = 11,
    NUM_VOLUME_FX   = 12
  };

  // If switching back to vector for some reason, 0 init these.
  uint8_t note;
  uint8_t instrument;
  uint8_t volume_effect;// = NO_VOLUME;
  uint8_t volume_param;
  uint8_t effect;
  uint8_t param;

  void set_volume(uint8_t volume)
  {
    if(volume <= 64)
    {
      volume_effect = SET_VOLUME;
      volume_param  = volume;
    }
    else

    if(volume >= 65 && volume <= 74)
    {
      volume_effect = FINE_VOLUME_UP;
      volume_param  = volume - 65;
    }
    else

    if(volume >= 75 && volume <= 84)
    {
      volume_effect = FINE_VOLUME_DN;
      volume_param  = volume - 75;
    }
    else

    if(volume >= 85 && volume <= 94)
    {
      volume_effect = VOLUME_UP;
      volume_param  = volume - 85;
    }
    else

    if(volume >= 95 && volume <= 104)
    {
      volume_effect = VOLUME_DN;
      volume_param  = volume - 95;
    }
    else

    if(volume >= 105 && volume <= 114)
    {
      volume_effect = PORTA_UP;
      volume_param  = volume - 105;
    }
    else

    if(volume >= 115 && volume <= 124)
    {
      volume_effect = PORTA_DN;
      volume_param  = volume - 115;
    }
    else

    if(volume >= 128 && volume <= 192)
    {
      volume_effect = SET_PAN;
      volume_param  = volume - 128;
    }
    else

    if(volume >= 193 && volume <= 202)
    {
      volume_effect = TONEPORTA;
      volume_param  = volume - 193;
    }
    else

    if(volume >= 203 && volume <= 212)
    {
      volume_effect = VIBRATO;
      volume_param  = volume - 203;
    }
    else
    {
      volume_effect = VOLUME_INVALID;
      volume_param  = volume;
    }
  }
};

struct IT_pattern
{
  // Using calloc instead of std::vector cuts ~20 seconds off of a
  // full scan of Modland's IT folder, a ~22% improvement when cached.
//  std::vector<IT_event> events;
  IT_event *events = nullptr;
  uint16_t raw_size_stored = 0;
  uint16_t raw_size = 0;
  uint16_t num_rows = 0;
  uint8_t  num_channels = 0;

  IT_pattern() {}
  ~IT_pattern()
  {
    free(events);
  }

  void allocate()
  {
//    events.resize(num_rows * num_channels);
    if(events)
      free(events);
    events = (IT_event *)calloc(num_rows * num_channels, sizeof(IT_event));
  }
};

struct IT_midiconfig
{
  char global[9][32];
  char sfx[16][32];
  char zxx[128][32];
};

struct IT_header
{
  /*  00 */ char     magic[4]; /* IMPM */
  /*  04 */ char     name[26];
  /*  30 */ uint16_t highlight;
  /*  32 */ uint16_t num_orders;
  /*  34 */ uint16_t num_instruments;
  /*  36 */ uint16_t num_samples;
  /*  38 */ uint16_t num_patterns;
  /*  40 */ uint16_t tracker_version;
  /*  42 */ uint16_t format_version;
  /*  44 */ uint16_t flags;
  /*  46 */ uint16_t special;

  /*  48 */ uint8_t  global_volume;
  /*  49 */ uint8_t  mix_volume;
  /*  50 */ uint8_t  initial_speed;
  /*  51 */ uint8_t  initial_tempo;
  /*  52 */ uint8_t  pan_separation;
  /*  53 */ uint8_t  midi_pitch_wheel;
  /*  54 */ uint16_t message_length;
  /*  56 */ uint32_t message_offset;
  /*  60 */ uint32_t reserved;

  /*  64 */ uint8_t  channel_pan[64];
  /* 128 */ uint8_t  channel_volume[64];
  /* 192 */
};

struct IT_data
{
  IT_header     header;
  IT_midiconfig midi;
  bool          uses[NUM_FEATURES];
  size_t        num_channels;

  std::vector<IT_sample>     samples;
  std::vector<IT_instrument> instruments;
  std::vector<IT_pattern>    patterns;
  std::vector<uint8_t>       orders;
  std::vector<uint32_t>      instrument_offsets;
  std::vector<uint32_t>      sample_offsets;
  std::vector<uint32_t>      pattern_offsets;

  std::vector<uint8_t>       workbuf;
};

/* Char 0 displays identically to a space (32) in name fields, but
 * not in filename fields.
 *
 * The string fields provide one extra uneditable char, presumably for
 * a terminator (even though char 0 doesn't terminate prior).
 */
template<int LEN>
static void IT_string_fix(char (&name)[LEN])
{
  for(int i = 0; i < LEN - 1; i++)
    if(name[i] == '\0')
      name[i] = ' ';

  name[LEN - 1] = '\0';
}

