/**
 * Copyright (C) 2020 Lachesis <petrifiedrowan@gmail.com>
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <memory>
#include <vector>

#include "modutil.hpp"

static const char MAGIC_MED2[] = "MED\x02";
static const char MAGIC_MED3[] = "MED\x03";
static const char MAGIC_MED4[] = "MED\x04";
static const char MAGIC_MMD0[] = "MMD0";
static const char MAGIC_MMD1[] = "MMD1";

  FT_CMD_PATTERN_DELAY_OVER_0F,
  FT_CMD_1F_DELAY,
  FT_CMD_1F_RETRIGGER,
  FT_CMD_1F_DELAY_RETRIGGER,
  FT_CMD_20_REVERSE,
  FT_CMD_20_RELATIVE_OFFSET,
  FT_CMD_LINEAR_PORTAMENTO,
  FT_CMD_TRACK_PANNING,
  FT_CMD_2F_ECHO_DEPTH,
  FT_CMD_2F_STEREO_SEPARATION,
  FT_CMD_2F_UNKNOWN,
  FT_INST_MIDI,
  FT_INST_IFFOCT,
  FT_INST_SYNTH,
  FT_INST_SYNTH_HYBRID,
  FT_INST_SYNTH_WF_GT_1,
  FT_INST_EXT,
  FT_INST_S16,
  FT_INST_STEREO,
  FT_INST_MD16,
  FT_INST_HOLD_DECAY,
  FT_INST_DEFAULT_PITCH,
  FT_INST_BIDI,
  FT_INST_DISABLE,
  FT_INST_LONG_REPEAT,
  FT_INST_LONG_REPEAT_DIFF,
  FT_INST_LONG_REPEAT_HIGH,
  FT_HYBRID_USES_IFFOCT,
  FT_HYBRID_USES_EXT,
  FT_HYBRID_USES_SYNTH,
  NUM_FEATURES
};

static const char * const FEATURE_DESC[NUM_FEATURES] =
{
  ">1Songs",
  "VarTracks",
  ">256Rows",
  "NoteHold",
  "Note1",
  "Oct4-7",
  "Oct8-A",
  "STrans",
  "ITrans",
  "8ChMode",
  "Tempo<=0A",
  "BRows!=4",
  "FilterOn",
  "ModSlide",
  "Tick0Slide",
  ">1CmdPages",
  "E:PortVol",
  "E:VibVol",
  "E:Tremolo",
  "E:HoldDecay",
  "E:900",
  "E:9<=20",
  "E:9>20",
  "E:FBrk",
  "E:FTwice",
  "E:FF1NoNote",
  "E:FDelay",
  "E:FThree",
  "E:FF3NoNote",
  "E:FF4",
  "E:FF5",
  "E:FFilter",
  "E:FPitch",
  "E:FStop",
  "E:FOff",
  "E:F<=0A",
  "E:F>0A",
  "E:FBPM<=2",
  "E:FBPM<=20",
  "E:FBPM",
  "E:FinePort",
  "E:PTVib",
  "E:Finetune",
  "E:Loop",
  "E:Loop>0F",
  "E:18Stop",
  "E:18Stop>0F",
  "E:Offset",
  "E:FineVol",
  "E:1DBrk",
  "E:PatDelay",
  "E:PatDelay>0F",
  "E:1FDelay",
  "E:1FRetrg",
  "E:1FBoth",
  "E:Reverse",
  "E:RelOffset",
  "E:LinearPort",
  "E:Pan",
  "E:EchoDepth",
  "E:StereoSep",
  "E:2F?",
  "I:MIDI",
  "I:IFFOct",
  "I:Synth",
  "I:Hybrid",
  "I:WF>1",
  "I:Ext",
  "I:S16",
  "I:Stereo",
  "I:Aura",
  "I:HoldDecay",
  "I:DefPitch",
  "I:Bidi",
  "I:Disable",
  "I:LongRep",
  "I:!=LongRep",
  "I:128kLongRep",
  "HybIFFOCT",
  "HybExt",
  "HybSyn(?!)",
};


/**************** OctaMED MMD0 and MMD1 ******************/

enum MMD0instrtype
{
  I_HYBRID  = -2,
  I_SYNTH   = -1,
  I_SAMPLE  = 0,
  I_IFF5OCT = 1,
  I_IFF3OCT = 2,
  I_IFF2OCT = 3,
  I_IFF4OCT = 4,
  I_IFF6OCT = 5,
  I_IFF7OCT = 6,
  I_EXT     = 7,

  /* Flags */
  I_TYPEMASK = 0x07,
  I_S16      = 0x10,
  I_STEREO   = 0x20,
  I_MD16     = 0x18,
};

enum MMD3instrflags
{
  SSFLG_LOOP     = 0x01,
  SSFLG_EXTPSET  = 0x02,
  SSFLG_DISABLED = 0x04,
  SSFLG_PINGPONG = 0x08,
};

static const char *MED_insttype_str(int t)
{
  switch(t)
  {
    case I_HYBRID:  return "Hyb";
    case I_SYNTH:   return "Syn";
    case I_SAMPLE:  return "Smp";
    case I_IFF5OCT: return "IO5";
    case I_IFF3OCT: return "IO3";
    case I_IFF2OCT: return "IO2";
    case I_IFF4OCT: return "IO4";
    case I_IFF6OCT: return "IO6";
    case I_IFF7OCT: return "IO7";
    case I_EXT:     return "Ext";
  }
  if((t & ~I_S16 & ~I_STEREO & ~I_MD16) == 0)
  {
    if(t & I_S16)
    {
      if(t & I_STEREO)
        return "S16S";
      else
        return "S16";
    }
    else
    if(t & I_STEREO)
      return "SmpS";
  }
  return "???";
}

struct MED_cmd_info
{
  const char *cmd;
  const char *description;
  int params;
};

static const MED_cmd_info MED_bad_command =
{
  "???", "Unknown command", 0
};

static const MED_cmd_info *MED_volcommand_strs(uint8_t cmd)
{
  static const MED_cmd_info MED_volcommands[16] =
  {
    { "SPD",   "Volume sequence speed [#]",     1 },
    { "WAI",   "Wait [#]",                      1 },
    { "CHD",   "Change volume down [#]",        1 },
    { "CHU",   "Change volume up [#]",          1 },
    { "EN1",   "Envelope waveform [#]",         1 },
    { "EN2",   "Envelope waveform (loop) [#]",  1 },
    { "RES",   "Reset volume",                  0 },
    { nullptr, nullptr, 0 },
    { nullptr, nullptr, 0 },
    { nullptr, nullptr, 0 },
    { "JWS",   "Jump waveform sequence to [#]", 1 },
    { "HLT",   "Halt sequence",                 0 },
    { nullptr, nullptr, 0 },
    { nullptr, nullptr, 0 },
    { "JMP",   "Jump to [#]",                   1 },
    { "END",   "End sequence",                  -1 },
  };
  static const MED_cmd_info set_volume = { " # ", "Set volume", 0 };

  if(cmd >= 0xF0 && MED_volcommands[cmd - 0xF0].cmd)
    return &MED_volcommands[cmd - 0xF0];

  if(cmd >= 0x80)
    return &MED_bad_command;

  return &set_volume;
}

static const MED_cmd_info *MED_wfcommand_strs(uint8_t cmd)
{
  static const MED_cmd_info MED_wfcommands[16] =
  {
    { "SPD",   "Waveform sequence speed [#]",       1 },
    { "WAI",   "Wait [#]",                          1 },
    { "CHD",   "Change pitch down (period up) [#]", 1 },
    { "CHU",   "Change pitch up (period down) [#]", 1 },
    { "VBD",   "Vibrato depth [#]",                 1 },
    { "VBS",   "Vibrato speed [#]",                 1 },
    { "RES",   "Reset pitch",                       0 },
    { "VWF",   "Vibrato waveform [#]",              1 },
    { nullptr, nullptr, 0 },
    { nullptr, nullptr, 0 },
    { "JVS",   "Jump volume sequence to [#]",       1 },
    { "HLT",   "Halt sequence",                     0 },
    { "ARP",   "Arpeggio definition start [#...]",  0xFD },
    { "ARE",   "Arpeggio definition end",           0 },
    { "JMP",   "Jump to [#]",                       1 },
    { "END",   "End sequence",                      -1 },
  };
  static const MED_cmd_info set_waveform = { " # ", "Set waveform", 0 };

  if(cmd >= 0xF0 && MED_wfcommands[cmd - 0xF0].cmd)
    return &MED_wfcommands[cmd - 0xF0];

  if(cmd >= 0x80)
    return &MED_bad_command;

  return &set_waveform;
}

enum MMD0flags
{
  F_FILTER_ON  = (1<<0),
  F_JUMPING_ON = (1<<1),
  F_JUMP_8TH   = (1<<2),
  F_INSTRSATT  = (1<<3), // ?
  F_VOLUME_HEX = (1<<4),
  F_MOD_SLIDES = (1<<5), // "ST/NT/PT compatible sliding"
  F_8_CHANNEL  = (1<<6), // "this is OctaMED 5-8 channel song"

  F2_BPM_MASK  = 0x1F,
  F2_BPM       = (1<<5), // BPM mode on.
};

enum MMD0effects
{
  E_ARPEGGIO         = 0x00,
  E_PORTAMENTO_UP    = 0x01,
  E_PORTAMENTO_DOWN  = 0x02,
  E_TONE_PORTAMENTO  = 0x03,
  E_VIBRATO          = 0x04,
  E_PORTA_VOLSLIDE   = 0x05,
  E_VIBRATO_VOLSLIDE = 0x06,
  E_TREMOLO          = 0x07,
  E_SET_HOLD_DECAY   = 0x08,
  E_SPEED            = 0x09,
  E_VOLUME_SLIDE_MOD = 0x0A,
  E_POSITION_JUMP    = 0x0B,
  E_SET_VOLUME       = 0x0C,
  E_VOLUME_SLIDE     = 0x0D,
  E_SYNTH_JUMP       = 0x0E,
  E_TEMPO            = 0x0F,
  E_FINE_PORTA_UP    = 0x11,
  E_FINE_PORTA_DOWN  = 0x12,
  E_VIBRATO_COMPAT   = 0x14,
  E_FINETUNE         = 0x15,
  E_LOOP             = 0x16,
  E_CHANGE_VOL_CTRL  = 0x17,
  E_STOP_NOTE        = 0x18,
  E_SAMPLE_OFFSET    = 0x19,
  E_FINE_VOLUME_UP   = 0x1A,
  E_FINE_VOLUME_DOWN = 0x1B,
  E_CHANGE_MIDI_PRE  = 0x1C,
  E_PATTERN_BREAK    = 0x1D,
  E_PATTERN_DELAY    = 0x1E,
  E_DELAY_RETRIGGER  = 0x1F,
  E_REVERSE_REL_OFF  = 0x20,
  E_LINEAR_PORTA_UP  = 0x21,
  E_LINEAR_PORTA_DN  = 0x22,
  E_TRACK_PANNING    = 0x2E,
  E_ECHO_STEREO_SEP  = 0x2F,
};

struct MMD0sample
{
  /* 0 */ uint16_t repeat_start;  // Divided by 2.
  /* 2 */ uint16_t repeat_length; // Divided by 2.
  /* 4 */ uint8_t  midi_channel;  // 0: not MIDI.
  /* 5 */ uint8_t  midi_preset;
  /* 6 */ uint8_t  default_volume;
  /* 7 */ int8_t   transpose;
};

struct MMD0song
{
  /*   0 */ MMD0sample samples[63];
  /* 504 */ uint16_t   num_blocks;
  /* 506 */ uint16_t   num_orders;
  /* 508 */ uint8_t    orders[256];
  /* 764 */ uint16_t   default_tempo;
  /* 766 */ int8_t     transpose;
  /* 767 */ uint8_t    flags;
  /* 768 */ uint8_t    flags2;
  /* 769 */ uint8_t    tempo2;
  /* 770 */ uint8_t    track_volume[16];
  /* 786 */ uint8_t    song_volume;
  /* 787 */ uint8_t    num_instruments;
};

struct MMD0note
{
  uint8_t note;
  uint8_t instrument;
  uint8_t effect;
  uint8_t param;

  void mmd0(int a, int b, int c)
  {
    note       = (a & 0x3F);
    instrument = ((a & 0x80) >> 3) | ((a & 0x40) >> 1) | ((b & 0xF0) >> 4); // WTF?
    effect     = (b & 0x0F);
    param      = c;
  }

  void mmd1(int a, int b, int c, int d)
  {
    note       = (a & 0x7F);
    instrument = (b & 0x3F);
    effect     = c;
    param      = d;
  }
};

struct MMD1block
{
  uint16_t num_tracks;       // uint8_t for MMD0
  uint16_t num_rows;         // uint8_t for MMD0 (stored as length - 1 for both)
  uint32_t blockinfo_offset; // MMD1 only.

  // These are from the BlockInfo struct.
  uint32_t  highlight_offset;
  uint32_t  block_name_offset;
  uint32_t  block_name_length;
  uint32_t  pagetable_offset;
  //uint32_t  reserved[6]; // just ignore these lol

  // These are from the BlockCmdPageTable struct.
  uint16_t  num_pages;
  //uint16_t  reserved;

  struct CommandPage
  {
    uint32_t offset = 0;
    bool loaded = false;
    std::vector<uint8_t> data;
  };

  std::vector<MMD0note>    events;
  std::vector<uint32_t>    highlight;
  std::vector<CommandPage> page;

  bool is_highlighted(unsigned row)
  {
    if(highlight.size() > row / 32)
    {
      uint32_t t = highlight[row / 32];
      uint32_t m = 1 << (row & 31);
      return (t & m) != 0;
    }
    return false;
  }
};

struct MMD0instr
{
  /*   0 */ uint32_t length;
  /*   4 */ int16_t  type;
};

struct MMD0synthWF
{
  /*   0 */ uint16_t length; // Divided by 2.
  /*   2 */ /* uint8_t data[]; */
};

/* Following fields are only present for synth instruments. */
struct MMD0synth
{
  /*   6 */ uint8_t  default_decay;        /* Used only when saving single instruments */
  /*   7 */ uint8_t  reserved[3];
  /*  10 */ uint16_t hy_repeat_start;      /* Used only when saving single instruments */
  /*  12 */ uint16_t hy_repeat_length;     /* Used only when saving single instruments */
  /*  14 */ uint16_t volume_table_length;
  /*  16 */ uint16_t waveform_table_length;
  /*  18 */ uint8_t  volume_table_speed;
  /*  19 */ uint8_t  waveform_table_speed;
  /*  20 */ uint16_t num_waveforms;
  /*  22 */ uint8_t  volume_table[128];
  /* 150 */ uint8_t  waveform_table[128];
  /* 278 */ uint32_t waveform_offsets[64]; /* struct SynthWF * */

  MMD0synthWF waveforms[64];
  /* Waveform 0 for hybrids is a sample. */
  MMD0instr hybrid_instrument;
};

/* Extra instrument data. */
struct MMD3instr_ext
{
  /* <V5: 4 bytes */

  /*   0 */ uint8_t    hold;
  /*   1 */ uint8_t    decay;
  /*   2 */ uint8_t    suppress_midi_off;
  /*   3 */ int8_t     finetune;

  /* V5: 8 bytes */

  /*   4 */ uint8_t    default_pitch;
  /*   5 */ uint8_t    instrument_flags;
  /*   6 */ uint16_t   long_midi_preset;

  /* V5.02: 10 bytes */

  /*   8 */ uint8_t    output_device;
  /*   9 */ uint8_t    reserved;

  /* V7: 18 bytes */

  /*  10 */ uint32_t   long_repeat_start;
  /*  14 */ uint32_t   long_repeat_length;
};

/* Instrument names. */
struct MMD3instr_info
{
  char name[41]; /* Is stored as 40. */
};

struct MMD3exp
{
  /*   0 */ uint32_t   nextmod_offset; /* struct MMD0 * */
  /*   4 */ uint32_t   sample_ext_offset; /* struct InstrExt * */
  /*   8 */ uint16_t   sample_ext_entries;
  /*  10 */ uint16_t   sample_ext_size;
  /*  12 */ uint32_t   annotation_offset;
  /*  16 */ uint32_t   annotation_length;
  /*  20 */ uint32_t   instr_info_offset; /* struct MMDInstrInfo * */
  /*  24 */ uint16_t   instr_info_entries;
  /*  26 */ uint16_t   instr_info_size;
  /*  28 */ uint32_t   jumpmask; /* ? */
  /*  32 */ uint32_t   rgbtable_offset;
  /*  36 */ uint32_t   channel_split;
  /*  40 */ uint32_t   notation_info_offset; /* struct NotationInfo * */
  /*  44 */ uint32_t   songname_offset;
  /*  48 */ uint32_t   songname_length;
  /*  52 */ uint32_t   dumps_offset; /* struct MMDDumpData * */
  /*  56 */ uint32_t   mmdinfo_offset; /* struct MMDInfo * */
  /*  60 */ uint32_t   mmdrexx_offset; /* struct MMDARexx * */
  /*  64 */ uint32_t   mmdcmd3x_offset; /* struct MMDMIDICmd3x * */
  /*  68 */ uint32_t   reserved[3];
  /*  80 */ uint32_t   tag_end; /* ? */
};

struct MMD0head
{
  /*  0 */ char     magic[4];
  /*  4 */ uint32_t file_length;
  /*  8 */ uint32_t song_offset; /* struct MMD0song * */
  /* 12 */ uint32_t reserved0;
  /* 16 */ uint32_t block_array_offset; /* struct MMD0Block ** */
  /* 20 */ uint32_t reserved1;
  /* 24 */ uint32_t sample_array_offset; /* struct InstrHdr ** */
  /* 28 */ uint32_t reserved2;
  /* 32 */ uint32_t expansion_offset; /* struct MMD0exp * */
  /* 36 */ uint32_t reserved3;
  /* 40 */ uint16_t player_state; /* All of these can be ignored... */
  /* 42 */ uint16_t player_block;
  /* 44 */ uint16_t player_line;
  /* 46 */ uint16_t player_sequence;
  /* 48 */ int16_t  actplayline;
  /* 50 */ uint8_t  counter;
  /* 51 */ uint8_t  num_extra_songs;
};

struct MMD0
{
  MMD0head       header;
  MMD0song       song;
  MMD3exp        exp;
  MMD1block      patterns[MAX_BLOCKS];
  MMD0instr      instruments[MAX_INSTRUMENTS];
  MMD3instr_ext  instruments_ext[MAX_INSTRUMENTS];
  MMD3instr_info instruments_info[MAX_INSTRUMENTS];
  uint32_t       pattern_offsets[MAX_BLOCKS];
  uint32_t       instrument_offsets[MAX_INSTRUMENTS];
  uint32_t       num_tracks;
  bool           use_long_repeat;
  bool           uses[NUM_FEATURES];

  std::vector<char>          songname;
  std::unique_ptr<MMD0synth> synth_data[MAX_INSTRUMENTS];
};

static modutil::error read_mmd(FILE *fp, int mmd_version)
{
  MMD0 m{};
  MMD0head &h = m.header;
  MMD0song &s = m.song;
  MMD3exp  &x = m.exp;

  /**
   * So many of these would need to be byte-reversed that
   * it's easier to just stream these values out (the pointer
   * packing in the synth struct breaks on modern machines anyway).
   */

  /**
   * Header.
   */
