/**
 * Copyright (C) 2020 Lachesis <petrifiedrowan@gmail.com>
 *
 * Permission to use, copy, modify, and distribute this software for any
 * purpose with or without fee is hereby granted, provided that the above
 * copyright notice and this permission notice appear in all copies.
 *
 * THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
 * WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
 * ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
 * WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
 * ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
 * OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "common.hpp"

static const char USAGE[] =
  "Dump information about OctaMED files.\n\n"
  "Usage:\n"
  "  medutil [filename.ext...]\n\n";

static const char MAGIC_MMD0[] = "MMD0";
static const char MAGIC_MMD1[] = "MMD1";
static const char MAGIC_MMD2[] = "MMD2";
static const char MAGIC_MMD3[] = "MMD3";

static bool dump_samples;
static bool dump_patterns;
static bool dump_pattern_rows;

static int num_med;
static int num_mmd0;
static int num_mmd1;
static int num_mmd2;
static int num_mmd3;
static int num_unknown;

static const int MAX_BLOCKS      = 256;
static const int MAX_INSTRUMENTS = 63;

enum MED_error
{
  MED_SUCCESS,
  MED_READ_ERROR,
  MED_SEEK_ERROR,
  MED_NOT_A_MED,
  MED_NOT_IMPLEMENTED,
  MED_TOO_MANY_BLOCKS,
  MED_TOO_MANY_INSTR,
};

static const char *MED_strerror(int err)
{
  switch(err)
  {
    case MED_SUCCESS:         return "no error";
    case MED_READ_ERROR:      return "read error";
    case MED_SEEK_ERROR:      return "seek error";
    case MED_NOT_A_MED:       return "not a .MED";
    case MED_NOT_IMPLEMENTED: return "feature not implemented";
    case MED_TOO_MANY_BLOCKS: return "only <=256 blocks supported";
    case MED_TOO_MANY_INSTR:  return "only <=63 instruments supported";
  }
  return "unknown error";
}

enum MED_features
{
  FT_MULTIPLE_SONGS,
  FT_VARIABLE_TRACKS,
  FT_OCTAVES_8_AND_9,
  FT_TRANSPOSE_SONG,
  FT_TRANSPOSE_INSTRUMENT,
  FT_8_CHANNEL_MODE,
  FT_INIT_TEMPO_COMPAT,
  FT_BEAT_ROWS_NOT_4,
  FT_CMD_PORTAMENTO_VOLSLIDE,
  FT_CMD_VIBRATO_VOLSLIDE,
  FT_CMD_TREMOLO,
  FT_CMD_HOLD_DECAY,
  FT_CMD_SPEED_DEFAULT,
  FT_CMD_SPEED_LO,
  FT_CMD_SPEED_HIGH,
  FT_CMD_BREAK,
  FT_CMD_PLAY_TWICE,
  FT_CMD_PLAY_TWICE_NO_NOTE,
  FT_CMD_PLAY_DELAY,
  FT_CMD_PLAY_THREE_TIMES,
  FT_CMD_PLAY_THREE_TIMES_NO_NOTE,
  FT_CMD_SET_PITCH,
  FT_CMD_STOP_PLAYING,
  FT_CMD_STOP_NOTE,
  FT_CMD_TEMPO_COMPAT,
  FT_CMD_TEMPO,
  FT_CMD_BPM_BUGGY,
  FT_CMD_BPM_LO,
  FT_CMD_BPM,
  FT_CMD_FINE_PORTAMENTO,
  FT_CMD_PT_VIBRATO,
  FT_CMD_FINETUNE,
  FT_CMD_LOOP,
  FT_CMD_LOOP_OVER_0F,
  FT_CMD_18_STOP,
  FT_CMD_18_STOP_OVER_0F,
  FT_CMD_OFFSET,
  FT_CMD_FINE_VOLUME,
  FT_CMD_1D_BREAK,
  FT_CMD_PATTERN_DELAY,
  FT_CMD_PATTERN_DELAY_OVER_0F,
  FT_CMD_1F_DELAY,
  FT_CMD_1F_RETRIGGER,
  FT_CMD_1F_DELAY_RETRIGGER,
  FT_INST_MIDI,
  FT_INST_IFFOCT,
  FT_INST_SYNTH,
  FT_INST_SYNTH_HYBRID,
  FT_INST_EXT,
  FT_INST_HOLD_DECAY,
  FT_INST_DEFAULT_PITCH,
  NUM_FEATURES
};

static const char * const FEATURE_DESC[NUM_FEATURES] =
{
  ">1Songs",
  "VarTracks",
  "Oct8/9",
  "STrans",
  "ITrans",
  "8ChMode",
  "Tempo<=0A",
  "BRows!=4",
  "CmPortVol",
  "CmVibVol",
  "CmTremolo",
  "CmHoldDecay",
  "Cm900",
  "Cm9<=20",
  "Cm9>20",
  "CmFBrk",
  "CmFTwice",
  "CmFF1NoNote",
  "CmFDelay",
  "CmFThree",
  "CmFF3NoNote",
  "CmFPitch",
  "CmFStop",
  "CmFOff",
  "CmF<=0A",
  "CmF>0A",
  "CmFBPM<=2",
  "CmFBPM<=20",
  "CmFBPM",
  "CmFinePort",
  "CmPTVib",
  "CmFinetune",
  "CmLoop",
  "CmLoop>0F",
  "Cm18Stop",
  "Cm18Stop>0F",
  "CmOffset",
  "CmFineVol",
  "Cm1DBrk",
  "CmPatDelay",
  "CmPatDelay>0F",
  "Cm1FDelay",
  "Cm1FRetrg",
  "Cm1FBoth",
  "MIDI",
  "IFFOct",
  "Synth",
  "Hybrid",
  "ExtSample",
  "HoldDecay",
  "DefPitch",
};

struct MED_handler
{
  const char *magic;
  int (*read_fn)(FILE *fp);
};

static int read_mmd0(FILE *fp);
static int read_mmd1(FILE *fp);
static int read_mmd2(FILE *fp);
static int read_mmd3(FILE *fp);

static const MED_handler HANDLERS[] =
{
  { MAGIC_MMD0, read_mmd0 },
  { MAGIC_MMD1, read_mmd1 },
  { MAGIC_MMD2, read_mmd2 },
  { MAGIC_MMD3, read_mmd3 },
};

/**************** OctaMED MMD0 and MMD1 ******************/

enum MMD0instrtype
{
  I_HYBRID  = -2,
  I_SYNTH   = -1,
  I_SAMPLE  = 0,
  I_IFF5OCT = 1,
  I_IFF3OCT = 2,
  I_IFF2OCT = 3,
  I_IFF4OCT = 4,
  I_IFF6OCT = 5,
  I_IFF7OCT = 6,
  I_EXT     = 7
};

static const char *MED_insttype_str(int t)
{
  switch(t)
  {
    case I_HYBRID:  return "Hyb";
    case I_SYNTH:   return "Syn";
    case I_SAMPLE:  return "Smp";
    case I_IFF5OCT: return "IO5";
    case I_IFF3OCT: return "IO3";
    case I_IFF2OCT: return "IO2";
    case I_IFF4OCT: return "IO4";
    case I_IFF6OCT: return "IO6";
    case I_IFF7OCT: return "IO7";
    case I_EXT:     return "Ext";
  }
  return "???";
}

enum MMD0flags
{
  F_FILTER_ON  = (1<<0),
  F_JUMPING_ON = (1<<1),
  F_JUMP_8TH   = (1<<2),
  F_INSTRSATT  = (1<<3), // ?
  F_VOLUME_HEX = (1<<4),
  F_MOD_SLIDES = (1<<5), // "ST/NT/PT compatible sliding"
  F_8_CHANNEL  = (1<<6), // "this is OctaMED 5-8 channel song"

  F2_BPM_MASK  = 0x1F,
  F2_BPM       = (1<<5), // BPM mode on.
};

enum MMD0effects
{
  E_ARPEGGIO         = 0x00,
  E_PORTAMENTO_UP    = 0x01,
  E_PORTAMENTO_DOWN  = 0x02,
  E_TONE_PORTAMENTO  = 0x03,
  E_VIBRATO          = 0x04,
  E_PORTA_VOLSLIDE   = 0x05,
  E_VIBRATO_VOLSLIDE = 0x06,
  E_TREMOLO          = 0x07,
  E_SET_HOLD_DECAY   = 0x08,
  E_SPEED            = 0x09,
  E_VOLUME_SLIDE_MOD = 0x0A,
  E_POSITION_JUMP    = 0x0B,
  E_SET_VOLUME       = 0x0C,
  E_VOLUME_SLIDE     = 0x0D,
  E_SYNTH_JUMP       = 0x0E,
  E_TEMPO            = 0x0F,
  E_FINE_PORTA_UP    = 0x11,
  E_FINE_PORTA_DOWN  = 0x12,
  E_VIBRATO_COMPAT   = 0x14,
  E_FINETUNE         = 0x15,
  E_LOOP             = 0x16,
  E_STOP_NOTE        = 0x18,
  E_SAMPLE_OFFSET    = 0x19,
  E_FINE_VOLUME_UP   = 0x1A,
  E_FINE_VOLUME_DOWN = 0x1B,
  E_PATTERN_BREAK    = 0x1D,
  E_PATTERN_DELAY    = 0x1E,
  E_DELAY_RETRIGGER  = 0x1F,
};

struct MMD0sample
{
  /* 0 */ uint16_t repeat_start;  // Divided by 2.
  /* 2 */ uint16_t repeat_length; // Divided by 2.
  /* 4 */ uint8_t  midi_channel;  // 0: not MIDI.
  /* 5 */ uint8_t  midi_preset;
  /* 6 */ uint8_t  default_volume;
  /* 7 */ int8_t   transpose;
};

struct MMD0song
{
  /*   0 */ MMD0sample samples[63];
  /* 504 */ uint16_t   num_blocks;
  /* 506 */ uint16_t   num_orders;
  /* 508 */ uint8_t    orders[256];
  /* 764 */ uint16_t   default_tempo;
  /* 766 */ int8_t     transpose;
  /* 767 */ uint8_t    flags;
  /* 768 */ uint8_t    flags2;
  /* 769 */ uint8_t    tempo2;
  /* 770 */ uint8_t    track_volume[16];
  /* 786 */ uint8_t    song_volume;
  /* 787 */ uint8_t    num_instruments;
};

struct MMD1block
{
  uint16_t num_tracks;       // uint8_t for MMD0
  uint16_t num_rows;         // uint8_t for MMD0 (stored as length - 1 for both)
  uint32_t blockinfo_offset; // MMD1 only.

  // These are from the blockinfo struct.
  uint32_t  highlight_offset;
  uint32_t  block_name_offset;
  uint32_t  block_name_length;
  //uint32_t  reserved[6]; // just ignore these lol
};

struct MMD0instr
{
  /*   0 */ uint32_t length;
  /*   4 */ int16_t  type;
};

/* Following fields are only present for synth instruments. */
struct MMD0synth
{
  /*   6 */ uint8_t  default_decay;
  /*   7 */ uint8_t  reserved[3];
  /*  10 */ uint16_t hy_repeat_offset;
  /*  12 */ uint16_t hy_repeat_length;
  /*  14 */ uint16_t volume_table_length;
  /*  16 */ uint16_t waveform_table_length;
  /*  18 */ uint8_t  volume_table_speed;
  /*  19 */ uint8_t  waveform_table_speed;
  /*  20 */ uint16_t num_waveforms;
  /*  22 */ uint8_t  volume_table[128];
  /* 150 */ uint8_t  waveform_table[128];
  /* 278 */ uint32_t waveform_offsets[64]; /* struct SynthWF * */
};

/* Extra instrument data. */
struct MMD3instr_ext
{
  /* <V5: 4 bytes */

  /*   0 */ uint8_t    hold;
  /*   1 */ uint8_t    decay;
  /*   2 */ uint8_t    suppress_midi_off;
  /*   3 */ int8_t     finetune;

  /* V5: 8 bytes */

  /*   4 */ uint8_t    default_pitch;
  /*   5 */ uint8_t    instrument_flags;
  /*   6 */ uint16_t   long_midi_preset;

  /* V5.02: 10 bytes */

  /*   8 */ uint8_t    output_device;
  /*   9 */ uint8_t    reserved;

  /* V7: 18 bytes */

  /*  10 */ uint32_t   long_repeat_start;
  /*  14 */ uint32_t   long_repeat_length;
};

/* Instrument names. */
struct MMD3instr_info
{
  char name[41]; /* Is stored as 40. */
};

struct MMD3exp
{
  /*   0 */ uint32_t   nextmod_offset; /* struct MMD0 * */
  /*   4 */ uint32_t   sample_ext_offset; /* struct InstrExt * */
  /*   8 */ uint16_t   sample_ext_entries;
  /*  10 */ uint16_t   sample_ext_size;
  /*  12 */ uint32_t   annotation_offset;
  /*  16 */ uint32_t   annotation_length;
  /*  20 */ uint32_t   instr_info_offset; /* struct MMDInstrInfo * */
  /*  24 */ uint16_t   instr_info_entries;
  /*  26 */ uint16_t   instr_info_size;
  /*  28 */ uint32_t   jumpmask; /* ? */
  /*  32 */ uint32_t   rgbtable_offset;
  /*  36 */ uint32_t   channel_split;
  /*  40 */ uint32_t   notation_info_offset; /* struct NotationInfo * */
  /*  44 */ uint32_t   songname_offset;
  /*  48 */ uint32_t   songname_length;
  /*  52 */ uint32_t   dumps_offset; /* struct MMDDumpData * */
  /*  56 */ uint32_t   mmdinfo_offset; /* struct MMDInfo * */
  /*  60 */ uint32_t   mmdrexx_offset; /* struct MMDARexx * */
  /*  64 */ uint32_t   mmdcmd3x_offset; /* struct MMDMIDICmd3x * */
  /*  68 */ uint32_t   reserved[3];
  /*  80 */ uint32_t   tag_end; /* ? */
};

struct MMD0head
{
  /*  0 */ char     magic[4];
  /*  4 */ uint32_t file_length;
  /*  8 */ uint32_t song_offset; /* struct MMD0song * */
  /* 12 */ uint32_t reserved0;
  /* 16 */ uint32_t block_array_offset; /* struct MMD0Block ** */
  /* 20 */ uint32_t reserved1;
  /* 24 */ uint32_t sample_array_offset; /* struct InstrHdr ** */
  /* 28 */ uint32_t reserved2;
  /* 32 */ uint32_t expansion_offset; /* struct MMD0exp * */
  /* 36 */ uint32_t reserved3;
  /* 40 */ uint16_t player_state; /* All of these can be ignored... */
  /* 42 */ uint16_t player_block;
  /* 44 */ uint16_t player_line;
  /* 46 */ uint16_t player_sequence;
  /* 48 */ int16_t  actplayline;
  /* 50 */ uint8_t  counter;
  /* 51 */ uint8_t  num_extra_songs;
};

struct MMD0note
{
  uint8_t note;
  uint8_t instrument;
  uint8_t effect;
  uint8_t param;

  void mmd0(int a, int b, int c)
  {
    note       = (a & 0x3F);
    instrument = ((a & 0x80) >> 3) | ((a & 0x40) >> 1) | ((b & 0xF0) >> 4); // WTF?
    effect     = (b & 0x0F);
    param      = c;
  }

  void mmd1(int a, int b, int c, int d)
  {
    note       = (a & 0x7F);
    instrument = (b & 0x3F);
    effect     = c;
    param      = d;
  }
};

struct MMD0
{
  MMD0head       header;
  MMD0song       song;
  MMD3exp        exp;
  MMD1block      patterns[MAX_BLOCKS];
  MMD0instr      instruments[MAX_INSTRUMENTS];
  MMD3instr_ext  instruments_ext[MAX_INSTRUMENTS];
  MMD3instr_info instruments_info[MAX_INSTRUMENTS];
  MMD0note      *pattern_data[MAX_BLOCKS];
  MMD0synth     *synth_data[MAX_INSTRUMENTS];
  uint32_t      *pattern_highlight[MAX_BLOCKS];
  uint32_t       pattern_offsets[MAX_BLOCKS];
  uint32_t       instrument_offsets[MAX_INSTRUMENTS];
